Autodesk.Revit.DB.AlphanumericRevisionSettings.SetSequence(System.Collections.Generic.IList{System.String})
Sets the sequence of strings to be used as numbers for revisions with the Alphanumeric RevisionNumberType.
Remarks:
If there are more alphanumeric revisions than there are
strings in the sequence, subsequent alphanumeric revisions will
be assigned duplicated characters. For example, if the sequence
provided were ["X", "Y"], the first alphanumeric revision would
be shown as "X", the second as "Y", the third as "XX", then "YY",
"XXX", etc.
sequence:
The sequence. The sequence strings cannot contain commas.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input sequence contains invalid entries.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.GetSequence
Gets a list containing the strings to be used as the numbering sequence for
revisions with the Alphanumeric RevisionNumberType.
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.IsValid
Determines whether the AlphanumericRevisionSettings object is in a valid state.
Remarks:
The AlphanumericRevisionSettings should have at least one string in its revision numbering sequence.
Returns:
True if the settings are valid.
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.IsEqual(Autodesk.Revit.DB.AlphanumericRevisionSettings)
Determines whether a specified AlphanumericRevisionSettings is the same as 'this'.
Remarks:
The two AlphanumericRevisionSettings are regarded as the same only if they have the same
revision numbering sequence, and the same prefix and suffix strings.
other:
The AlphanumericRevisionSettings object to be compared with 'this'.
Returns:
True, if two AlphanumericRevisionSettings are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AlphanumericRevisionSettings.Suffix
The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.Prefix
The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor(System.Collections.Generic.IList{System.String},System.String,System.String)
Constructs an AlphanumericRevisionSettings object.
sequence:
The custom sequence to be used as numbers for revisions with the
Alphanumeric RevisionNumberType.
If there are more alphanumeric revisions than there are
strings in the sequence, subsequent alphanumeric revisions will
be assigned duplicated characters. For example, if the sequence
provided were ["X", "Y"], the first alphanumeric revision would
be shown as "X", the second as "Y", the third as "XX", then "YY",
"XXX", etc.
prefix:
The prefix string for each revision number in the sequence.
suffix:
The suffix string for each revision number in the sequence.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Input sequence contains invalid entries.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor
Constructs an AlphanumericRevisionSettings with a simple, default sequence.
Remarks:
The default sequence contains each letter of the alphabet (may differ based on language settings).
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings.#ctor(Autodesk.Revit.DB.AlphanumericRevisionSettings)
Constructs a new copy of the input AlphanumericRevisionSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
other is not a valid AlphanumericRevisionSettings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.AlphanumericRevisionSettings
Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.
Since:
2016